Обработки/DataProcessors/_ПечатьИВыгрузкаУведомленияОДвиженииЦБ_Инфинитум.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ПечатьИВыгрузкаУведомленияОДвиженииЦБ_Инфинитум</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТребованияФонда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТребованияФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПеререгистрацииПрав</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДепозитарногоДоговораКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДепозитарногоДоговораКонтрагента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Comment>0 - Поступление, 1 - Передача, 2 - Перевод</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервогоСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРазделаКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДепонента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыДвиженияЦБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПереводЦенныхБумаг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПеререгистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Обработки/DataProcessors/_ПечатьИВыгрузкаУведомленияОДвиженииЦБ_Инфинитум/_ПечатьИВыгрузкаУведомленияОДвиженииЦБ_Инфинитум/Forms/Форма/Ext/Form/Module.bsl
#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация 			  	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	Объект.ДатаИВремяФормирования 	= ТекущаяДата();
	Объект.НомерПервогоСообщения 	= 1;
				
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ОбновитьВидимостьЭлементов();
	Элементы.ДокументыДвиженияЦБДокумент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ВводЦенныхБумаг");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область События_Элементов_Формы

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Объект.Организация, Объект.Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ПодписантДолжность = СтруктураДанныхКонтактногоЛица.Должность;
	ВыбранноеЗначение  = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
		
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Объект.КаталогДанных; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Объект.КаталогДанных = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.КаталогДанных + "\");

КонецПроцедуры

&НаКлиенте
Процедура ДокументыДиженияЦБДокументПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДокументыДвиженияЦБ.ТекущиеДанные;
	Если ТекущиеДанные.Документ = ПредопределенноеЗначение("Документ.ВыводЦенныхБумаг.ПустаяСсылка")
		Или ТекущиеДанные.Документ = ПредопределенноеЗначение("Документ.ВводЦенныхБумаг.ПустаяСсылка")
		Или ТекущиеДанные.Документ = ПредопределенноеЗначение("Документ.ПереводЦенныхБумаг.ПустаяСсылка") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.Документ, "Рынок, ДепозитарныйСчет, " + ?(Объект.ВидДвижения >= 2, "ДепозитарныйСчетПолучатель", "Контрагент"));
	
	// У перевода выведем счет ДЕПО в Инфинитуме. Это либо отправитель, либо получатель
	Если Объект.ВидДвижения = 2 Тогда
		ДепозитарийСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДокумента.ДепозитарныйСчет, "Депозитарий");
		Если ДепозитарийСчета = ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_Инфинитум") Тогда
			ДЕПО_Инфинитум = РеквизитыДокумента.ДепозитарныйСчет;
		Иначе
			ДЕПО_Инфинитум = РеквизитыДокумента.ДепозитарныйСчетПолучатель;
		КонецЕсли;		
	Иначе
		ДЕПО_Инфинитум = РеквизитыДокумента.ДепозитарныйСчет;	
	КонецЕсли;
	
	ТекущиеДанные.Рынок 		= РеквизитыДокумента.Рынок;
	ТекущиеДанные.СчетДепо 		= ДЕПО_Инфинитум;
	ТекущиеДанные.Контрагент 	= ?(Объект.ВидДвижения >= 2, "", РеквизитыДокумента.Контрагент);  	
	
КонецПроцедуры     

&НаКлиенте
Процедура ВидДвиженияПриИзменении(Элемент)
	
	ОбновитьВидимостьЭлементов();
	
	Если Объект.ДокументыДвиженияЦБ.Количество() > 0 Тогда
		Объект.ДокументыДвиженияЦБ.Очистить();
	КонецЕсли;	
		
	// Назначим тип для выбора документам в табличной части
	Если Объект.ВидДвижения = 0 Тогда
		Элементы.ДокументыДвиженияЦБДокумент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ВводЦенныхБумаг");
	ИначеЕсли Объект.ВидДвижения = 1 Тогда
	    Элементы.ДокументыДвиженияЦБДокумент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ВыводЦенныхБумаг");
	Иначе
		Элементы.ДокументыДвиженияЦБДокумент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ПереводЦенныхБумаг");
	КонецЕсли;
	
	ОбновитьСписокВыбораКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
		
	Объект.НаименованиеДепонента = СформироватьНаименованиеДепонента(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ДатаИВремяФормирования);
	
	ОбновитьСписокВыбораКонтрагента();

	Если Объект.ДокументыДвиженияЦБ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДокументыДвиженияЦБ[0].Документ) Тогда
		Объект.ДокументыДвиженияЦБ.Очистить(); 
		Возврат;
	КонецЕсли;
	
	Если Объект.СчетДоверительногоУправления <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументыДвиженияЦБ[0].Документ, "СчетДоверительногоУправления") Тогда
		Объект.ДокументыДвиженияЦБ.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИВремяФормированияПриИзменении(Элемент)
	
	Объект.НаименованиеДепонента = СформироватьНаименованиеДепонента(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ДатаИВремяФормирования);
	
	ОбновитьСписокВыбораКонтрагента();
	
	Если Объект.ДокументыДвиженияЦБ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДокументыДвиженияЦБ[0].Документ) Тогда
		Объект.ДокументыДвиженияЦБ.Очистить(); 
		Возврат;
	КонецЕсли;
	
	Если НачалоДня(Объект.ДатаИВремяФормирования) <> НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументыДвиженияЦБ[0].Документ, "Дата")) Тогда
		Объект.ДокументыДвиженияЦБ.Очистить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыДвиженияЦБПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	УсловиеВыполнено = ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) И Объект.ДатаИВремяФормирования <> '00010101';
	ТекстСообщения = "Счет ДУ, дата и время составления должны быть заполнены";
	
	Если Объект.ВидДвижения < 2 Тогда
		УсловиеВыполнено = УсловиеВыполнено И ЗначениеЗаполнено(Объект.Контрагент);
		ТекстСообщения = "Счет ДУ, контрагент, дата и время составления должны быть заполнены";
	КонецЕсли;
	
	Если Не УсловиеВыполнено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.ДокументыДвиженияЦБ.Очистить();
	ЗаполнитьТаблицуДокументовНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим спецдеп, разрешен только Инфинитум
	Если Не ПроверитьСпецДепозитарий(ВыбранноеЗначение, Объект.ВидДвижения) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	// Обновляем организацию
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Объект.СчетДоверительногоУправления = "";    
	Элементы.Контрагент.СписокВыбора.Очистить();
	Объект.Контрагент = "";
	Объект.ДокументыДвиженияЦБ.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область Команды_Формы

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Печать");
	ВыполнитьПечать(ПараметрыСессии);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПечать(ПараметрыСессии)
	
	// Печать доступна только для вида "Передача" и "Перевод"
	Если Объект.ВидДвижения = 0 Тогда
		ТекстОшибки = "Печать доступна только для вида движения 'Передача' или 'Перевод'";
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Не пройдена проверка заполнения");
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьСпецДепозитарий(Объект.СчетДоверительногоУправления, Объект.ВидДвижения, ПараметрыСессии) Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Не пройдена проверка специализированного депозитария");
		Возврат;
	КонецЕсли;

	Если Объект.ДокументыДвиженияЦБ.Количество() = 0 Тогда
		ТекстОшибки = "Не указаны документы для печати";
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьДокументыНаСервере() Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Не пройдена проверка документов");
		Возврат;
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Отказ = Ложь;
	ПечатьНаСервере(ТабДокумент, Отказ);
	
	Если Отказ Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Ошибка при формировании печатной формы на сервере");
		Возврат;
	КонецЕсли;
	
	ТабДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ОтображатьСетку 	= Ложь;
	ТабДокумент.ТолькоПросмотр 		= Истина;
	ИспользуемоеИмяФайла = ?(ПустаяСтрока(Объект.КаталогДанных), "", Объект.КаталогДанных + "\") + "Уведомление_" + СокрЛП(Объект.Организация) + "_" + СокрЛП(Объект.Контрагент) + ".xlsx"; 
	ТабДокумент.Показать("Уведомление", ИспользуемоеИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьТаблицуДокументов(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаЗаполнитьТаблицуДокументов");
	ВыполнитьЗаполнениеТаблицыДокументов(ПараметрыСессии);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеТаблицыДокументов(ПараметрыСессии)
	
	УсловиеВыполнено = ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) И Объект.ДатаИВремяФормирования <> '00010101' И Объект.СрокПеререгистрацииПрав <> '00010101';
	ТекстСообщения = "Счет ДУ, срок перерегистрации, дата и время составления должны быть заполнены";
	
	Если Объект.ВидДвижения < 2 Тогда
		УсловиеВыполнено = УсловиеВыполнено И ЗначениеЗаполнено(Объект.Контрагент);
		ТекстСообщения = "Счет ДУ, контрагент, срок перерегистрации, дата и время составления должны быть заполнены";
	КонецЕсли;
	
	Если Не УсловиеВыполнено Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуДокументовНаСервере(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЭкспортировать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаЭкспортировать");
	ВыполнитьЭкспорт(ПараметрыСессии);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЭкспорт(ПараметрыСессии)
	
	Если Не ПроверитьЗаполнение() Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Не пройдена проверка заполнения");
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьКаталог(ПараметрыСессии) Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Не пройдена проверка каталога выгрузки");
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьСпецДепозитарий(Объект.СчетДоверительногоУправления, Объект.ВидДвижения, ПараметрыСессии) Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Не пройдена проверка специализированного депозитария");
		Возврат;
	КонецЕсли;

	Если Объект.ДокументыДвиженияЦБ.Количество() = 0 Тогда
		ТекстОшибки = "Не указаны документы для выгрузки";
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьДокументыНаСервере() Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Не пройдена проверка документов");
		Возврат;
	КонецЕсли;

	// При выгрузке дополнительно проверяем реквизиты контрагента
	Если Объект.ВидДвижения < 2 Тогда
		
		ПроверяемыеРеквизиты = Новый Массив;
		ПроверяемыеРеквизиты.Добавить("НомерДепозитарногоДоговораКонтрагента");
		ПроверяемыеРеквизиты.Добавить("ДатаДепозитарногоДоговораКонтрагента");
		ПроверяемыеРеквизиты.Добавить("НомерРазделаКонтрагента");		
		
		Отказ = Ложь;
		Для Каждого ТекРеквизит Из ПроверяемыеРеквизиты Цикл
			Если Не ЗначениеЗаполнено(Объект[ТекРеквизит]) Тогда
				ТекстОшибки = "Не указано значение реквизита " + Элементы[ТекРеквизит].Заголовок;
				ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "Объект." + ТекРеквизит, , Отказ);
			КонецЕсли;
		КонецЦикла;
		
		Если Отказ Тогда
			ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Не заполнены обязательные реквизиты контрагента");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
		
	Отказ = Ложь;
	ЭкспортироватьНаСервере(Отказ, ПараметрыСессии);
	
	Если Не Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка завершена");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Служебные_Процедуры_и_Функции

&НаСервере
Процедура ЭкспортироватьНаСервере(Отказ, ПараметрыСессии = Неопределено)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ТекНомерСообщения = Объект.НомерПервогоСообщения;
	ДанныеДляВыгрузки = ОбъектОбработки.ПолучитьДанныеДляВыгрузки(Отказ, ТекНомерСообщения);
	
	Если Отказ Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Ошибка при получении данных для выгрузки");
		Возврат;
	КонецЕсли;
	
	Объект.НомерПервогоСообщения = ТекНомерСообщения;	
	
	Для Каждого ПакетДанных Из ДанныеДляВыгрузки Цикл		
		ИмяФайла = Объект.КаталогДанных + "\" + ПакетДанных.ИмяФайла;
		СформироватьXML(ПакетДанных, ИмяФайла, Отказ, ПараметрыСессии);
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьXML(ПакетДанных, ИмяФайлаXML, Отказ, ПараметрыСессии = Неопределено)
		
	ЗаписьXML = Новый ЗаписьXML;
	
	Попытка 
		ЗаписьXML.ОткрытьФайл(ИмяФайлаXML, "UTF-8");
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		Возврат;
	КонецПопытки;
	
	Если Объект.ВидДвижения = 0 Тогда
		// Поступление
		КорневойТэг = "INSTRUCTION_TO_DEPO_TRANSFER";
	ИначеЕсли Объект.ВидДвижения = 1 Тогда
		// Списание
		КорневойТэг = "INSTRUCTION_TO_DEPO_WRITE_OFF";
	ИначеЕсли Объект.ВидДвижения = 3 Тогда
		// Перевод внутри Инфинитума
		КорневойТэг = "INSTRUCTION_TO_DEPO_PLACE_STORAGE";  	
	Иначе
		// Перевод, аналогично
		Если ПакетДанных.ВидПеревода = "Перевод_Поступление" Тогда
			КорневойТэг = "INSTRUCTION_TO_DEPO_TRANSFER";
		Иначе
			КорневойТэг = "INSTRUCTION_TO_DEPO_WRITE_OFF";
		КонецЕсли;
	КонецЕсли;
	
	Кавычки = Символ(34);
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента(КорневойТэг); 
	 
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", "http://www.w3.org/2001/XMLSchema-instance"); 
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd", "http://www.w3.org/2001/XMLSchema");
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("version");
	ЗаписьXML.ЗаписатьТекст("1.5.0");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("header");
	ЗаписьXML.ЗаписатьНачалоЭлемента("doc_num");
	ЗаписьXML.ЗаписатьТекст(Формат(Объект.ДатаИВремяФормирования, "ДФ=ddMMyy") + "-" + ПакетДанных.НомерСообщения);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("doc_date");
	ЗаписьXML.ЗаписатьНачалоЭлемента("date");
	ЗаписьXML.ЗаписатьТекст(Формат(Объект.ДатаИВремяФормирования, "ДФ=yyyy-MM-dd"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("account_dtls");
	ЗаписьXML.ЗаписатьНачалоЭлемента("account_id");
	ЗаписьXML.ЗаписатьНачалоЭлемента("id");
	ЗаписьXML.ЗаписатьТекст(ПакетДанных.НомерСчета);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("organization");
	ЗаписьXML.ЗаписатьТекст("SPED");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("account_name");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(Объект.НаименованиеДепонента));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("account_holder");
	ЗаписьXML.ЗаписатьНачалоЭлемента("party_id");
	ЗаписьXML.ЗаписатьНачалоЭлемента("id");
	ЗаписьXML.ЗаписатьТекст(ПакетДанных.ОГРНОрганизации);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("scheme_name");
	ЗаписьXML.ЗаписатьТекст("OGRN");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("party_name");
	ЗаписьXML.ЗаписатьТекст(ПакетДанных.КраткоеНаименованиеОрганизации);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("transaction");
	
	// Новый договор со спецдепом
	ЗаписьXML.ЗаписатьНачалоЭлемента("based_info");
	ЗаписьXML.ЗаписатьНачалоЭлемента("contract_type");
	ЗаписьXML.ЗаписатьНачалоЭлемента("contract_code");
	ЗаписьXML.ЗаписатьТекст("DEPA");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("narrative");
	ЗаписьXML.ЗаписатьТекст("Депозитарный договор");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("contract_doc_num");
	ЗаписьXML.ЗаписатьТекст(?(Объект.ВидДвижения >= 2, ПакетДанных.НомерДепозитарногоДоговораПолучатель, ПакетДанных.НомерДепозитарногоДоговораКонтрагента)); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("contract_doc_date");
	ЗаписьXML.ЗаписатьТекст(Формат(?(Объект.ВидДвижения >= 2, ПакетДанных.ДатаДепозитарногоДоговораПолучатель, ПакетДанных.ДатаДепозитарногоДоговораКонтрагента), "ДФ=yyyy-MM-dd")); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// Старый договор со спецдепом, не нужен для перевода внутри Инфинитума
	Если Объект.ВидДвижения <> 3 Тогда	
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("based_info");
		ЗаписьXML.ЗаписатьНачалоЭлемента("contract_type");
		ЗаписьXML.ЗаписатьНачалоЭлемента("contract_code");
		ЗаписьXML.ЗаписатьТекст("DEPA");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("narrative");
		ЗаписьXML.ЗаписатьТекст("Депозитарный договор");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("contract_doc_num");
		ЗаписьXML.ЗаписатьТекст(ПакетДанных.НомерДепозитарногоДоговора);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("contract_doc_date");
		ЗаписьXML.ЗаписатьТекст(Формат(ПакетДанных.ДатаДепозитарногоДоговора, "ДФ=yyyy-MM-dd"));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();

	КонецЕсли;
	
	// Уведомление о передаче активов
	ЗаписьXML.ЗаписатьНачалоЭлемента("based_info");
	ЗаписьXML.ЗаписатьНачалоЭлемента("contract_type");
	ЗаписьXML.ЗаписатьНачалоЭлемента("contract_code");
	ЗаписьXML.ЗаписатьТекст("OTHR");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("narrative");
	ЗаписьXML.ЗаписатьТекст("Уведомление о передаче активов");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("contract_doc_num");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(Объект.НомерТребованияФонда));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("contract_doc_date");
	ЗаписьXML.ЗаписатьТекст(Формат(Объект.ДатаТребованияФонда, "ДФ=yyyy-MM-dd"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

	//ЦБ
	ЗаписьXML.ЗаписатьНачалоЭлемента("security");
	ЗаписьXML.ЗаписатьНачалоЭлемента("security_code");
	ЗаписьXML.ЗаписатьНачалоЭлемента("id");
	ЗаписьXML.ЗаписатьТекст(ПакетДанных.ISIN);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("organization");
	ЗаписьXML.ЗаписатьТекст("ISIN");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("financial_instrument_form");
	ЗаписьXML.ЗаписатьТекст("DOCM");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("state_reg_num");
	ЗаписьXML.ЗаписатьТекст(ПакетДанных.ГосударственныйРегистрационныйНомер);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ISIN_identifier");
	ЗаписьXML.ЗаписатьТекст(ПакетДанных.ISIN);
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("security_classification_CFI");
	ЗаписьXML.ЗаписатьТекст(ПакетДанных.CFI);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("quantity");
	ЗаписьXML.ЗаписатьНачалоЭлемента("units");
	ЗаписьXML.ЗаписатьТекст(Формат(ПакетДанных.Количество, "ЧГ=0"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// Контрагент, отсутствует для перевода внутри Инфинитума
	Если Объект.ВидДвижения <> 3 Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("contragent");
		ЗаписьXML.ЗаписатьНачалоЭлемента("indivdiual_or_entity");
		ЗаписьXML.ЗаписатьТекст("LEGL");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("full_name");
		ЗаписьXML.ЗаписатьТекст(ПакетДанных.ПолноеНаименованиеСД);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("nationality");
		ЗаписьXML.ЗаписатьТекст("643");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("entity_reg_dtls");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("reg_doc_type");
		ЗаписьXML.ЗаписатьНачалоЭлемента("entity_reg_doc_type_code");
		ЗаписьXML.ЗаписатьТекст("OGRN");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("reg_num");
		ЗаписьXML.ЗаписатьТекст(ПакетДанных.ОГРН_СД);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("date_of_incorporation");
		ЗаписьXML.ЗаписатьТекст(Формат(ПакетДанных.ДатаОГРН_СД, "ДФ=yyyy-MM-dd"));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("reg_org");
		ЗаписьXML.ЗаписатьТекст(ПакетДанных.ОрганОГРН_СД);
		ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();

	КонецЕсли;
	
	// Для этого вида завершаем секцию transaction
	Если Объект.ВидДвижения = 3 Тогда
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли; 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("data_storag");
	ЗаписьXML.ЗаписатьНачалоЭлемента("depository");
	ЗаписьXML.ЗаписатьНачалоЭлемента("party_id");
	ЗаписьXML.ЗаписатьНачалоЭлемента("id");
	ЗаписьXML.ЗаписатьТекст(ПакетДанных.ОГРН_НРД);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("scheme_name");
	ЗаписьXML.ЗаписатьТекст("OGRN");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("party_name");
	ЗаписьXML.ЗаписатьТекст("НКО АО НРД");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("account_storage_id");
	ЗаписьXML.ЗаписатьНачалоЭлемента("party_id");
	ЗаписьXML.ЗаписатьНачалоЭлемента("id");
	ЗаписьXML.ЗаписатьТекст(ПакетДанных.МестоХранения); 
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	ЗаписьXML.ЗаписатьНачалоЭлемента("organization");
	ЗаписьXML.ЗаписатьТекст("SPED");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Объект.ВидДвижения = 3 Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("party_name");
		ЗаписьXML.ЗаписатьТекст("Счет в Небанковская кредитная организация акционерное общество " + Кавычки + "Национальный расчетный депозитарий" + Кавычки);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;

	ЗаписьXML.ЗаписатьКонецЭлемента(); 	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("account_section_storage_id");
	ЗаписьXML.ЗаписатьНачалоЭлемента("party_id");
	ЗаписьXML.ЗаписатьНачалоЭлемента("id");
	ЗаписьXML.ЗаписатьТекст(?(Объект.ВидДвижения = 2, ?(ПакетДанных.ВидПеревода = "Перевод_Поступление", ПакетДанных.РазделМестаХраненияПолучатель, ПакетДанных.РазделМестаХранения), ПакетДанных.РазделМестаХранения)); 
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	ЗаписьXML.ЗаписатьНачалоЭлемента("organization");
	ЗаписьXML.ЗаписатьТекст("SPED");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если Объект.ВидДвижения = 3 Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("party_name");
		ЗаписьXML.ЗаписатьТекст("Торговый раздел");
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// Данные о новом месте хранения. Требуются только для перевода внутри Инфинитума
	Если Объект.ВидДвижения = 3 Тогда
			
		ЗаписьXML.ЗаписатьНачалоЭлемента("data_storag_new");
		ЗаписьXML.ЗаписатьНачалоЭлемента("depository");
		ЗаписьXML.ЗаписатьНачалоЭлемента("party_id");
		ЗаписьXML.ЗаписатьНачалоЭлемента("id");
		ЗаписьXML.ЗаписатьТекст(ПакетДанных.ОГРН_НРД);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("scheme_name");
		ЗаписьXML.ЗаписатьТекст("OGRN");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();

		ЗаписьXML.ЗаписатьНачалоЭлемента("party_name");
		ЗаписьXML.ЗаписатьТекст("НКО АО НРД");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("account_storage_id");
		ЗаписьXML.ЗаписатьНачалоЭлемента("party_id");
		ЗаписьXML.ЗаписатьНачалоЭлемента("id");
		ЗаписьXML.ЗаписатьТекст(ПакетДанных.МестоХранения); 
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		ЗаписьXML.ЗаписатьНачалоЭлемента("organization");
		ЗаписьXML.ЗаписатьТекст("SPED");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("party_name");
		ЗаписьXML.ЗаписатьТекст("Счет в Небанковская кредитная организация акционерное общество " + Кавычки + "Национальный расчетный депозитарий" + Кавычки);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); 	
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("account_section_storage_id");
		ЗаписьXML.ЗаписатьНачалоЭлемента("party_id");
		ЗаписьXML.ЗаписатьНачалоЭлемента("id");
		ЗаписьXML.ЗаписатьТекст(ПакетДанных.РазделМестаХраненияПолучатель); 
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		ЗаписьXML.ЗаписатьНачалоЭлемента("organization");
		ЗаписьXML.ЗаписатьТекст("SPED");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("party_name");
		ЗаписьXML.ЗаписатьТекст("Торговый раздел");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
					
	КонецЕсли;	
	
	// Прочие данные о перерегистрации. Не требуются для перевода внутри Инфинитума
	Если Объект.ВидДвижения <> 3 Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("settlement_depository");
		ЗаписьXML.ЗаписатьНачалоЭлемента("NDC");
		ЗаписьXML.ЗаписатьНачалоЭлемента("sd_ndc");
		ЗаписьXML.ЗаписатьНачалоЭлемента("id");
		ЗаписьXML.ЗаписатьТекст(?(Объект.ВидДвижения = 2, ПакетДанных.МестоХраненияКонтрагента, ПакетДанных.МестоХранения)); 
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		ЗаписьXML.ЗаписатьНачалоЭлемента("organization");
		ЗаписьXML.ЗаписатьТекст("NADC");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("sd_type");
		ЗаписьXML.ЗаписатьТекст("112");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("sd_id");
		ЗаписьXML.ЗаписатьНачалоЭлемента("id");
		ЗаписьXML.ЗаписатьТекст(?(Объект.ВидДвижения = 2, ПакетДанных.ИдентификаторСДКонтрагента, ПакетДанных.ИдентификаторСД)); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьНачалоЭлемента("organization");
		ЗаписьXML.ЗаписатьТекст("NADC");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("section");
		ЗаписьXML.ЗаписатьНачалоЭлемента("id");
		ЗаписьXML.ЗаписатьТекст(СокрЛП(?(Объект.ВидДвижения = 2, ?(ПакетДанных.ВидПеревода = "Перевод_Поступление", ПакетДанных.РазделМестаХранения, ПакетДанных.РазделМестаХраненияПолучатель), Объект.НомерРазделаКонтрагента)));
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		ЗаписьXML.ЗаписатьНачалоЭлемента("organization");
		ЗаписьXML.ЗаписатьТекст("NADC");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();	
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("payment_terms");
		ЗаписьXML.ЗаписатьНачалоЭлемента("payment_term");
		ЗаписьXML.ЗаписатьНачалоЭлемента("payment_term_type_code");
		ЗаписьXML.ЗаписатьТекст("FOP");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("trade_date");
		ЗаписьXML.ЗаписатьТекст(Формат(Объект.ДатаИВремяФормирования, "ДФ=yyyy-MM-dd"));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("settlement_date");
		ЗаписьXML.ЗаписатьТекст(Формат(ПакетДанных.ДатаПеререгистрации, "ДФ=yyyy-MM-dd"));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЕсли;	

	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
		
	// Заменяем пространства имен на исходные
	ТекстФайла = Новый ТекстовыйДокумент;
	ТекстФайла.Прочитать(ИмяФайлаXML, "UTF-8");
		
	Кавычки = Символ(34);
	
	ЗаменяемаяСтрока = "<" + КорневойТэг + " xmlns='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema'>";
	ЗаменяемаяСтрока = СтрЗаменить(ЗаменяемаяСтрока, "'", Кавычки);
	СтрокаЗамены = "<" + КорневойТэг + " xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' version='1'>";
										 
	СтрокаЗамены = СтрЗаменить(СтрокаЗамены, "'", Кавычки);
		
	ТекстФайла.ЗаменитьСтроку(2, СтрокаЗамены);
	
	Попытка 
		ТекстФайла.Записать(ИмяФайлаXML, "UTF-8");
	Исключение
		ТекстОшибки = "Не удалось записать файл " + ИмяФайлаXML + ": " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДокументовНаСервере(ПараметрыСессии = Неопределено)
	
	Объект.ДокументыДвиженияЦБ.Очистить();
	
	ВыборкаДокументовПоЦБ = ПолучитьВыборкуДокументов(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ДатаИВремяФормирования, Объект.Контрагент, Объект.ВидДвижения);
	
	Если ВыборкаДокументовПоЦБ.Количество() = 0 Тогда
		
		ТекстДокумента = "вводы";
		Если Объект.ВидДвижения = 1 Тогда
			ТекстДокумента = "выводы";
		ИначеЕсли Объект.ВидДвижения >= 2 Тогда
			ТекстДокумента = "переводы";
		КонецЕсли;
		
		ТекстОшибки = "Отсутствуют " + ТекстДокумента + " ценных бумаг на выбранную дату"
			+ ?(Объект.ВидДвижения >= 2, "", " по контрагенту " + СокрЛП(Объект.Контрагент));
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;

	КонецЕсли;
	
	Пока ВыборкаДокументовПоЦБ.Следующий() Цикл
		НоваяСтрока = Объект.ДокументыДвиженияЦБ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДокументовПоЦБ);
		НоваяСтрока.ДатаПеререгистрации = Объект.СрокПеререгистрацииПрав;
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьНаименованиеДепонента(Организация, СчетДоверительногоУправления, Период)
	
	Если Не ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда		
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораПоУправлениюПенсионнымиНакоплениямиИРезервами = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровПоУправлениюПенсионнымиНакоплениямиИРезервами.СВ)
		|			ТОГДА ""Срочная выплата""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораПоУправлениюПенсионнымиНакоплениямиИРезервами = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровПоУправлениюПенсионнымиНакоплениямиИРезервами.ВР)
		|			ТОГДА ""Выплатной резерв""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораПоУправлениюПенсионнымиНакоплениямиИРезервами = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровПоУправлениюПенсионнымиНакоплениямиИРезервами.РОПС)
		|			ТОГДА ""РОПС""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидДоговораПН,
		|	ВЫБОР
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА "" Д.У. средствами пенсионных накоплений для финансирования накопительной пенсии ""
		|		ИНАЧЕ "" Д.У. ""
		|	КОНЕЦ КАК ВставкаДУ,
		|	РеквизитыОрганизации.ПолноеНаименованиеПоУставу КАК НаименованиеОрганизации,
		|	РеквизитыКлиента.ПолноеНаименованиеПоУставу КАК НаименованиеКлиента
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыОрганизации
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Организация.ЮрФизЛицо = РеквизитыОрганизации.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКлиента
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыКлиента.ЮрФизЛицо";
	
	Запрос.УстановитьПараметр("Период", НачалоДня(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не сформировано наименование депонента");
		Возврат "";
	КонецЕсли;
	
	Возврат Выборка.НаименованиеОрганизации + Выборка.ВставкаДУ + Выборка.НаименованиеКлиента + ?(ПустаяСтрока(Выборка.ВидДоговораПН), "", " (" + Выборка.ВидДоговораПН + ")");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВыборкуДокументов(Организация, СчетДоверительногоУправления, ДатаДокумента, Контрагент, ВидДвижения)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Документ.Ссылка КАК Документ,
		|	Документ.ДепозитарныйСчет КАК СчетДепо,
		|	Документ.Контрагент КАК Контрагент,
		|	Документ.Рынок КАК Рынок		
		|ИЗ
		|	Документ.ВыводЦенныхБумаг КАК Документ
		|ГДЕ
		|	Документ.Организация = &Организация
		|	И Документ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И НАЧАЛОПЕРИОДА(Документ.Дата, ДЕНЬ) = &Дата
		|	И НЕ Документ.ПометкаУдаления";
	
	Если ВидДвижения < 2 Тогда
		Запрос.Текст = Запрос.Текст + "
		|И Документ.Контрагент = &Контрагент";
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
	ИначеЕсли ВидДвижения = 3 Тогда
	
		Запрос.Текст = Запрос.Текст + "
		|И Документ.ДепозитарныйСчет.Депозитарий = Документ.ДепозитарныйСчетПолучатель.Депозитарий";
		
	КонецЕсли;
	
	Если ВидДвижения = 0 Тогда
		// Поступление
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ВыводЦенныхБумаг", 	"Документ.ВводЦенныхБумаг");
	ИначеЕсли ВидДвижения >= 2 Тогда
		// Перевод
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ВыводЦенныхБумаг", 	"Документ.ПереводЦенныхБумаг");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Контрагент", 		"""""");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ДепозитарныйСчет КАК СчетДепо", 	"ВЫБОР КОГДА Документ.ДепозитарныйСчет.Депозитарий = &Инфинитум ТОГДА Документ.ДепозитарныйСчет ИНАЧЕ Документ.ДепозитарныйСчетПолучатель КОНЕЦ КАК СчетДепо");
		Запрос.УстановитьПараметр("Инфинитум", 	ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_Инфинитум"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", 					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Дата", 							НачалоДня(ДатаДокумента));
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

&НаСервере
Процедура ПечатьНаСервере(ТабДокумент, Отказ)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ОбъектОбработки.СформироватьПечатнуюФормуУведомления(ТабДокумент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	
	ВидимостьГруппыКонтрагент = Объект.ВидДвижения < 2;
	
	Элементы.ГруппаКонтрагент.Видимость = ВидимостьГруппыКонтрагент;
	
	Если Не ВидимостьГруппыКонтрагент Тогда
		
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Объект.Контрагент = "";
			Элементы.Контрагент.СписокВыбора.Очистить();
		КонецЕсли;
		
		Если ПустаяСтрока(Объект.НомерДепозитарногоДоговораКонтрагента) Тогда
			Объект.НомерДепозитарногоДоговораКонтрагента = "";
		КонецЕсли;
		
		Если ПустаяСтрока(Объект.НомерРазделаКонтрагента) Тогда
			Объект.НомерРазделаКонтрагента = "";
		КонецЕсли;
		
		Если Объект.ДатаДепозитарногоДоговораКонтрагента <> '00010101' Тогда
			Объект.ДатаДепозитарногоДоговораКонтрагента = '00010101';
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКаталог(ПараметрыСессии = Неопределено)
	
	ТекстСообщения = "";
	Если ПустаяСтрока(Объект.КаталогДанных) Тогда
		ТекстСообщения = "Не указан каталог для выгрузки файлов";
	Иначе
		ТекКаталог = Новый Файл(Объект.КаталогДанных);	
		Если ТекКаталог.Существует() Тогда
			Если ТекКаталог.ЭтоФайл() Тогда
				ТекстСообщения = "Указан путь к файлу выгрузки данных, а не каталог. Необходимо выбрать каталог";
			ИначеЕсли ТекКаталог.ПолучитьТолькоЧтение() Тогда
				ТекстСообщения = "Отсутствует доступ к выбранному каталогу выгрузки";				
			КонецЕсли;
		Иначе
			ТекстСообщения = "Выбранный каталог выгрузки не существует";	
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.КаталогДанных");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьДокументыНаСервере()
	Возврат ПроверитьДокументы(Объект.ДокументыДвиженияЦБ.Выгрузить(), Объект.ДатаИВремяФормирования, Объект.ВидДвижения, Объект.Контрагент);
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьДокументы(ТаблицаДокументов, ДатаФормирования, ВидДвижения, Контрагент)
	
	// У всех документов проверяем дату и пометку удаления; 
	// В переводах у счета ДЕПО-отправителя или у счета ДЕПО-получателя должен быть Инфинитум, для вида движения 3 - в обоих случаях Инфинитум;
	// У вводов и выводов проверяем контрагента
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Документы.Документ КАК Документ,
		|	_Документы.СчетДепо КАК ДепозитарныйСчет,
		|	_Документы.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ _Документы
		|ИЗ
		|	&Документы КАК _Документы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Документы.Документ КАК Документ,
		|	""Дата"" КАК ВидОшибки
		|ИЗ
		|	_Документы КАК _Документы
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(_Документы.Документ КАК Документ.ВводЦенныхБумаг).Дата, ДЕНЬ) <> &Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Документы.Документ,
		|	""ПометкаУдаления""
		|ИЗ
		|	_Документы КАК _Документы
		|ГДЕ
		|	ВЫРАЗИТЬ(_Документы.Документ КАК Документ.ВводЦенныхБумаг).ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Документы.Документ,
		|	""ДепозитарныйСчет""
		|ИЗ
		|	_Документы КАК _Документы
		|ГДЕ
		|	ВЫРАЗИТЬ(_Документы.ДепозитарныйСчет КАК Справочник.ДепозитарныеСчета).Депозитарий <> &Инфинитум
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Документы.Документ,
		|	""ДепозитарныйСчетПолучатель""
		|ИЗ
		|	Документ.ПереводЦенныхБумаг КАК ПереводЦБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Документы КАК _Документы
		|		ПО ПереводЦБ.Ссылка = _Документы.Документ
		|ГДЕ
		|	ПереводЦБ.ДепозитарныйСчетПолучатель.Депозитарий <> &Инфинитум
		|	И &ВидДвижения = 3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Документы.Документ,
		|	""ПереводМеждуСпецДепами""
		|ИЗ
		|	Документ.ПереводЦенныхБумаг КАК ПереводЦБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Документы КАК _Документы
		|		ПО ПереводЦБ.Ссылка = _Документы.Документ
		|ГДЕ
		|	&ВидДвижения = 2
		|	И ПереводЦБ.ДепозитарныйСчетПолучатель.Депозитарий = &Инфинитум
		|	И ПереводЦБ.ДепозитарныйСчет.Депозитарий = &Инфинитум
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Документы.Документ,
		|	""Контрагент""
		|ИЗ
		|	_Документы КАК _Документы
		|ГДЕ
		|	&ВидДвижения < 2
		|	И _Документы.Контрагент <> &Контрагент";
	
	Если ВидДвижения = 1 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ВводЦенныхБумаг", "Документ.ВыводЦенныхБумаг");
	ИначеЕсли ВидДвижения >= 2 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ВводЦенныхБумаг", "Документ.ПереводЦенныхБумаг"); 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Документы", 		ТаблицаДокументов);
	Запрос.УстановитьПараметр("Период", 		НачалоДня(ДатаФормирования));
	Запрос.УстановитьПараметр("ВидДвижения", 	ВидДвижения);
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Инфинитум", 		ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_Инфинитум")); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Успешно = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		ТекстОшибки = "";
		Если Выборка.ВидОшибки = "Дата" Тогда 
			ТекстОшибки = "У документа " + СокрЛП(Выборка.Документ) + " дата не совпадает с указанной";
		ИначеЕсли Выборка.ВидОшибки = "ПометкаУдаления" Тогда  			
			ТекстОшибки = "Документ " + СокрЛП(Выборка.Документ) + " помечен на удаление, его необходимо убрать из таблицы к выгрузке"; 	
		ИначеЕсли Выборка.ВидОшибки = "ДепозитарныйСчет" Тогда  			
			ТекстОшибки = "У документа " + СокрЛП(Выборка.Документ) + " депозитарий одного из счетов ДЕПО 'Откуда' или 'Куда' должен быть 'Инфинитум'"; 
		ИначеЕсли Выборка.ВидОшибки = "ДепозитарныйСчетПолучатель" Тогда  			
			ТекстОшибки = "У документа " + СокрЛП(Выборка.Документ) + " депозитарий счетов ДЕПО 'Откуда' и 'Куда' должен быть 'Инфинитум'"; 
		ИначеЕсли Выборка.ВидОшибки = "ПереводМеждуСпецДепами" Тогда  			
			ТекстОшибки = "У перевода между спец. депами " + СокрЛП(Выборка.Документ) + " 'Инфинитум' может быть депозитарием только у одного из счетов ДЕПО 'Откуда' или 'Куда'"; 	
		ИначеЕсли Выборка.ВидОшибки = "Контрагент" Тогда
			ТекстОшибки = "У документа " + СокрЛП(Выборка.Документ) + " контрагент не совпадает с выбранным";
		КонецЕсли;			
			
		Если ТекстОшибки <> "" Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Выборка.Документ);	
			Успешно = Ложь;	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Успешно;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьСпецДепозитарий(СчетДоверительногоУправления, ВидДвижения, ПараметрыСессии = Неопределено)
	
	Если ВидДвижения >= 2 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЭтоИнфинитум = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДоверительногоУправления, "СпециализированныйДепозитарий") = ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_Инфинитум");
	
	Если Не ЭтоИнфинитум Тогда
		ТекстОшибки = "У счета доверительного управления должен быть специализированный депозитарий 'Инфинитум'";
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Возврат ЭтоИнфинитум;
		
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокВыбораКонтрагента()

	Если Объект.ВидДвижения >= 2 Тогда
		// для перевода просто очищаем, контрагент не требуется
		Элементы.Контрагент.СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;
	
	Если Не (ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) И ЗначениеЗаполнено(Объект.ДатаИВремяФормирования)) Тогда
		Элементы.Контрагент.СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;
		
	СписокКонтрагентов = ПолучитьСписокКонтрагентов(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ДатаИВремяФормирования, Объект.ВидДвижения);
	
	Элементы.Контрагент.СписокВыбора.ЗагрузитьЗначения(СписокКонтрагентов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокКонтрагентов(Организация, СчетДоверительногоУправления, ДатаДокумента, ВидДвижения)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Документ.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.ВыводЦенныхБумаг КАК Документ
		|ГДЕ
		|	Документ.Организация = &Организация
		|	И Документ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И НАЧАЛОПЕРИОДА(Документ.Дата, ДЕНЬ) = &Дата
		|	И НЕ Документ.ПометкаУдаления
		|	И Документ.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)";
				
	Если ВидДвижения = 0 Тогда
		// Поступление
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ВыводЦенныхБумаг", 	"Документ.ВводЦенныхБумаг");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", 					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Дата", 							НачалоДня(ДатаДокумента));

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");

КонецФункции

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элемент.СписокВыбора.Количество() = 0 Тогда
		
		СтандартнаяОбработка = Ложь;				
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют " + ?(Объект.ВидДвижения = 0, "вводы", "выводы") + " ценных бумаг на выбранную дату");
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервереБезКонтекста
Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки)
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ДополнитьПараметрыВыполненияСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия, Новый Структура("ТекстОшибки", ТекстОшибки));
	
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюОбъекта(
		РеквизитФормыВЗначение("Объект"), ИмяКоманды);
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);
	
КонецПроцедуры

#КонецОбласти
